Repository: andredias/codelab
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: pt_br

source: Code Lab is an online editor, runner and linter for Python, Ruby, C/C++ and other programming languages
pt_br: Code Lab é um conjunto de ferramentas online para editar, executar e aprimorar programas em Python, Ruby, C/C++ e várias outras linguagens

source: Code Lab: Nothing like being able to run my code online...
pt_br: Code Lab: Nada como poder rodar meu código online...

source: Type
pt_br: Tipo

source: Bug
pt_br: Defeito

source: Suggestion
pt_br: Sugestão

source: Question
pt_br: Pergunta

source: Subject
pt_br: Assunto

source: Description
pt_br: Descrição

source: Name
pt_br: Nome

source: Contact
pt_br: Contato

source: Some validation errors occurred. Please correct the fields and submit the form again
pt_br: Alguns erros aconteceram durante a validação. Por favor, corrija os campos e envie novamente o formulário

source: Required Field
pt_br: Campo obrigatório

source: Cancel
pt_br: Cancelar

source: Submit
pt_br: Enviar

source: Project Title
pt_br: Título do Projeto

source: Project description
pt_br: Descrição do projeto

source: Save Project Info
pt_br: Salvar Informação do Projeto

source: Increase Font Size
pt_br: Aumentar o tamanho da fonte

source: Decrease Font Size
pt_br: Diminuir o tamanho da fonte

source: Input
pt_br: Entrada

source: Input Data
pt_br: Dados de Entrada

source: Output
pt_br: Saída

source: Position
pt_br: Posição

source: Message
pt_br: Mensagem

source: Level
pt_br: Nível

source: FAQ
pt_br: Perguntas Frequentes

source: Frequent Asked Questions (FAQ)
pt_br: Perguntas Frequentes (Frequent Asked Questions - FAQ)

source: What is Code Lab?
pt_br: O que é o Code Lab?

source: Code Lab is an online compiler and lint tool which allows you to run, improve and share your code using several programming languages.
pt_br: Code Lab é uma ferramenta online de compilação e lint que permite executar, aprimorar e compartilhar seu código-fonte em várias linguagens de programação.

source: Are there any memory or time constraints for the submitted programs?
pt_br: Existem restrições de memória e tempo para os programas submetidos?

source: Yes, they are as follows:
pt_br: Sim, conforme listado a seguir:

source: compilation time
pt_br: tempo de compilação

source: seconds
pt_br: segundos

source: execution time
pt_br: Tempo de execução

source: memory usage
pt_br: Uso de memória

source: Can I access the Internet from my program?
pt_br: Posso acessar a internet do meu programa?

source: No, access to the network is blocked.
pt_br: Não, o acesso à internet é bloqueado.

source: Can I write or read files in my program?
pt_br: Meu programa pode ler ou escrever arquivos?

source: Yes, but there is an 1 MiB limit of disk space.
pt_br: Sim, mas há um limite de 1 MiB de espaço em disco.

source: How long my codes will be stored on Code Lab?
pt_br: Quanto tempo meu programa fica armazenado no Code Lab?

source: months
pt_br: meses

source: What is the size limit for the source code, input and output?
pt_br: Qual é o limite de tamanho para o código-fonte, entrada e saída?

source: What encoding is used in the source code and in the input stream?
pt_br: Qual a codificação do código fonte e dos valores de entrada?

source: How is end of line (EOL) represented in the source code and in the input stream?
pt_br: Como o caracter de fim de linha (EoL) é representado?

source: <em>End of line</em> is represented by <code>\n</code> (LF, Linux style). Even if you submit input or source code with Windows EOL (<code>\r\n</code>, CRLF) or Mac OS EOL (<code>\r</code>, CR), end-of-lines will be converted to the Linux style.
pt_br: O caracter de fim de linha é representado por <code>\n</code> (LF). Mesmo que você submeta seu código com a quebra de linha usada no Windows (<code>\r\n</code>, CRLF) ou no Mac OS (<code>\r</code>, CR), os caracteres serão convertidos para LF.

source: My program seems to have a correct syntax. Why does it fail to execute?
pt_br: Meu programa parece estar sintaticamente correto. Por que ele não executa?

source: Be sure to place "main" class/program/module/function/procedure in your code (<a href="/samples">here you will find a sample</a> for every language).
pt_br: Verifique que seu programa tenha uma classe/programa/módulo/função/procedimento chamado "main".

source: I would like to see a new language or library on Code Lab. Is there anything I can do about that?
pt_br: Eu gostaria de ver uma nova linguagem ou biblioteca no Code lab. Há algo que eu possa fazer sobre isso?

source: Yes, please
pt_br: Sim, por favor

source: contact us
pt_br: entre em contato

source: %(num)s visit
pt_br: %(num)s visita

source: visited %(momento)s
pt_br: visitado há %(momento)s

source: Terms of Use
pt_br: Termos de Uso

source: Copyright
pt_br: Direitos Reservados a

source: Run, improve and share your source code online!
pt_br: Execute, melhore e compartilhe online seu código fonte!

source: Page {current_page} of {max_page}
pt_br: Página {current_page} de {max_page}

source: <span>Run</span>, <span>improve</span> and <span>share</span> your code online!
pt_br: <span>Execute</span>, <span>melhore</span> e <span>compartilhe</span> seu código-fonte online!

source: Examples
pt_br: Exemplos

source: Recent
pt_br: Recentes

source: Most Visited
pt_br: Mais Visitados

source: All
pt_br: Todos

source: How It Works
pt_br: Como Funciona

source: Code Lab uses <a href="http://en.wikipedia.org/wiki/Batch_processing">batch processing</a>. It means that your program executes without human interaction.
pt_br: O processamento é em lotes (<a href="http://en.wikipedia.org/wiki/Batch_processing">batch processing</a>). Isto significa que a execução do programa acontece sem interação humana.

source: Despite the execution flow or processing type, all input data are sent at once to the standard input (<code>stdin</code>) from where your program can read as needed.
pt_br: Independentemente do fluxo de execução ou tipo de processamento, todos os dados de entrada são enviados de uma só vez à entrada padrão (<code>stdin</code>) para que seu programa os leia à medida que forem necessários.

source: The processing takes place in a controlled environment (<em>sandbox</em>) which has some restrictions of time (5s), memory (256MiB), disk (1MiB), user access (non <code>root</code>), and network access (none).
pt_br: O processamento acontece em um ambiente controlado (<em>sandbox</em>), que possui restrições de tempo (5s), memória (256MiB), disco (1MiB), usuário (não é o <code>root</code>) e acesso à rede (sem acesso).

source: The processing output is collected from standard output and error streams (<code>stdout</code> and <code>stderr</code>) and presented back to you.
pt_br: O resultado apresentado é a combinação do que foi enviado pelo programa à saída padrão (<code>stdout</code>) e à saída de erros (<code>stderr</code>).

source: Example
pt_br: Exemplo

source: Program
pt_br: Programa

source: border
pt_br: borda

source: Enter the border:
pt_br: Digite a borda:

source: title
pt_br: titulo

source: Enter the title:
pt_br: Digite o título:

source: Improve
pt_br: Melhore

source: Code Lab executes a static analysis over your code in search for optimization improvements, potential defects and inconsistencies with a programming style guide. The analysis report is presented in a tab called "Lint".
pt_br: O Code Lab faz uma análise estática sobre seu código para otimização, verificação de defeitos em potencial e sugestões de padronização de estilo. O relatório da análise é apresentado em uma aba chamada "Lint".

source: Use those suggestions to improve your code!
pt_br: Use essas sugestões para melhorar seu código!

source: Share
pt_br: Compartilhe

source: Each combination of input data and source code produces a unique address (URL) that should be used to share your code and results to others, forums, social media, IRC etc.
pt_br: Cada combinação dos dados de entrada com o código fonte corresponde a um endereço único (URL) que deve ser usado para compartilhar seu código e os resultados diretamente com outras pessoas ou em fóruns, redes sociais, IRC etc.

source: Your message was sent successfully!
pt_br: Sua mensagem foi enviada com sucesso!

source: Snippets
pt_br: Trechos

source: The service is provided "AS IS", without warranty of any kind, express or implied, including but not limited to the warranties of merchantability, fitness for a particular purpose and noninfringement. In no event shall Code Lab or its licensors be liable for any claim, damages or other liability, whether in an action of contract, tort or otherwise, arising from, out of or in connection with the service or the use or other dealings in the service.
pt_br: O serviço é prestado "COMO ESTÁ", sem qualquer tipo de garantia, expressa ou implícita, incluindo, mas não limitado às garantias de comercialização, adequação a um propósito e não-infração. Em nenhum caso o Code Lab ou algum de seus licenciadores será responsável por qualquer reivindicação, dano ou outra responsabilidade, seja em uma ação de contrato, ato ilícito ou de outra forma, resultantes do uso do serviço.

source: Code Lab and its licensors disclaim any warranties regarding the security, reliability, timeliness, and performance of the services. Code Lab and its licensors disclaim, any warranties for any information, content or advice obtained through the services.
pt_br: O Code Lab e seus licenciadores renunciam quaisquer garantias relativas à segurança, confiabilidade, pontualidade e desempenho dos serviços. O Code Lab e seus licenciadores renunciam quaisquer garantias para qualquer informação, conteúdo ou conselhos obtidos através dos serviços.

source: Code Lab takes no responsibility for the content published by users, and for the content of comments they post on the Code Lab site.
pt_br: O Code Lab não se responsabiliza pelo conteúdo publicado pelos usuários e pelo conteúdo dos comentários publicados no site do Code Lab.

source: By submitting, posting or displaying content on the Code Lab Site, you grant Code Lab and other users of the Services a worldwide, non-exclusive, royalty-free license (with the right to sublicense) to use, copy, reproduce, process, adapt, modify, publish, transmit, display and distribute such Content in any and all media or distribution methods (now known or later developed). Specifically, the
pt_br: Ao enviar, postar ou exibir conteúdo no site do Code Lab Código, você concede ao Code Lab e a outros usuários dos serviços uma licença mundial, não-exclusiva, livre de royalties (com o direito de sublicenciar) para usar, copiar, reproduzir, processar, adaptar, modificar, publicar, transmitir, exibir e distribuir esse conteúdo em toda e qualquer mídia ou métodos de distribuição (agora conhecida ou desenvolvida posteriormente). Especificamente, seguindo a

source: You are responsible for your use of the Code Lab service, for any content you provide, and for any consequences thereof, including the use of your content by other users and third party partners. You understand that your content may be republished and if you do not have the right to submit content for such use, it may subject you to liability. Code Lab will not be responsible or liable for any use of your Content in accordance with these Terms of Use.
pt_br: Você é responsável por seu uso do serviço Code Lab, por qualquer conteúdo por você fornecido, e por todas as consequências, incluindo o uso de seu conteúdo por outros usuários e parceiros de terceiros. Você entende que o seu conteúdo pode ser republicado e se você não tem o direito de enviar conteúdo para tal uso, pode sujeitá-lo à responsabilidade. O Code Lab não será responsável por qualquer uso de seu conteúdo, de acordo com estes Termos de Uso.

source: In the course of using the Code Lab Site, you may provide Code Lab with feedback, including but not limited to suggestions, observations, errors, problems, and defects regarding the Code Lab Site. You hereby grant Code Lab a worldwide, irrevocable, perpetual, royalty-free, transferable and sub-licensable, non-exclusive right to use, copy, modify, distribute, display, perform, create derivative works from and otherwise exploit all such feedback.
pt_br: No decurso da utilização do site do Code Lab, você pode fornecer comentários relativos (mas não limitadas) a sugestões, observações, erros, problemas e defeitos em relação ao site do Code Lab. Você concede ao Code Lab uma licença mundial, perpétua, irrevogável, livre de royalties transferível e sub-licenciável, não exclusiva para usar, copiar, modificar, distribuir, exibir, executar, criar trabalhos derivados e de outro modo explorar todos esses comentários.
